Revit 2027 API
GroupTypeId.EnergyAnalysisAdvanced Property
 Advanced.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisAdvanced { get; }
Public Shared ReadOnly Property EnergyAnalysisAdvanced As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisAdvanced {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisAdvanced : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace